app/controllers/employees_controller.rb

	def index
		@employee = Employee.all
---
SELECT "employees".* FROM "employees"

	def create
		@employee = Employee.new(employee_params)
		if @employee.save
---
INSERT INTO "employees" ("id_card", "name", "username", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id_card", 123456], ["name", "Tatjana Tanaskovic"], ["username", "tatjanatanaskovic"], ["email", "tatjanatanaskovich@gmail.com"]]

	def update
		if @employee.update(employee_params)
---
UPDATE "employees" SET "username" = $1 WHERE "employees"."id" = $2  [["username", "tatjanatanaskovich"], ["id", 1]]

	def destroy
		@employee.destroy
---
DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 2]]